package test;

public class 자바기초용어모음 {
    // 접근 제한자
    // 클래스의 접근할 수 있는 범위



    // static
    // 정적 변수 또는 클래스 변수라고 하며 인스턴스화를 하지 않아도 사용 가능



    // final
    // 초기화를 해야하며 선언시 값이 변경 안됨



    // super VS this
    // 슈퍼는 상속 받은 클래스의 부모클래스의 호출
    // 디스는 자기 자신의 객체를 호출


    // 오버로딩 VS 오버라이딩
    // 오버로딩은 같은 클래스에 여러개의 생성자를 정의
    // 오버라이딩은 상속 받은 메서드를 재정의


    // abstract
    // 추상화할 때 붙여주는 키워드. 메서드나 클래스 앞에 붙여줌



    // interface VS abstract class
    // 인터페이스: 인터페이스는 상속을 여러번 할 수 있으며 키워드는 implements를 사용
    //              모두 추상 메서드 사용
    // 추상클래스: 추상 메서드 하나만 있으면 자식에게 상속해줄 수 있으며 extends 키워드 사용
    //              일반 메서드가 있어도 상속 가능


    // extends VS implements
    // extends: 클래스-클래스 인터페이스-인터페이스에게 상속 시킬 때 사용
    // implements: 인터페이스-클래스로 인터페이스를 상속할 때 사용



    // try-catch-finally
    /*
        try 문으로 에러 코드를 작성한 후 catch 문으로 상기의 에러 타입을 어떻게 반환시킬건지 명명
        finally try문에서 에러 발생 여부와 관계없이 실행될 코드
    */


}
